adamkondraciuk/nrfx/mdk/iar_startup_nrf7120_application.s
        PUBWEAK  SERIAL24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL24_IRQHandler
        B .

        PUBWEAK  TAMPC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TAMPC_IRQHandler
        B .

        PUBWEAK  SPU30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU30_IRQHandler
        B .

        PUBWEAK  SERIAL30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL30_IRQHandler
        B .

        PUBWEAK  COMP_LPCOMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
COMP_LPCOMP_IRQHandler
        B .

        PUBWEAK  WDT30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT30_IRQHandler
        B .

        PUBWEAK  WDT31_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT31_IRQHandler
        B .

        PUBWEAK  GPIOTE30_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE30_0_IRQHandler
        B .

        PUBWEAK  GPIOTE30_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE30_1_IRQHandler
        B .

        PUBWEAK  CLOCK_POWER_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CLOCK_POWER_IRQHandler
        B .

        PUBWEAK  USBREG_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBREG_IRQHandler
        B .

        PUBWEAK  LFXO_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LFXO_IRQHandler
        B .

        PUBWEAK  LFRC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LFRC_IRQHandler
        B .

        PUBWEAK  HFXO64M_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
HFXO64M_IRQHandler
        B .

        PUBWEAK  VREGMRAM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGMRAM_IRQHandler
        B .

        PUBWEAK  VREGAO1V8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGAO1V8_IRQHandler
        B .

        PUBWEAK  VREGAO0V8B_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGAO0V8B_IRQHandler
        B .

        PUBWEAK  VREGAO0V8A_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGAO0V8A_IRQHandler
        B .

        END


